# Расчёт финансов для выплаты долга
#
# Необходимо составить программу, которая делает:
# расчёт сумм пополнений счёта,
# подсчитывает прибыль получаемую от торговли,
# подсчитывает изменения по кредиту выданному брокерской фирмой,
# высчитывает новые кредиты, взятые для выплаты кредита взятого от брокерской компании
# вычисляет изменения по балансу
# определяет тип пополнения собственные средства\заёмные
# постоянно высчитывает суммы, которые необходимо отдать и сумму собственных средств
# вычисляет среднюю сумму получаемой прибыли в день и неделю
# вносит календарное деление день недели, дата

Balance = [] # общая сумма средств
Broker_Loan = [3000]
print(f'{Broker_Loan}')
People_loan = []

